blog-posts/2008-01-07-january-chapter-7-taking-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>January &#x2013; Chapter 7: Taking Notes</title>
<!-- 2014-04-30 Wed 17:05 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">January &#x2013; Chapter 7: Taking Notes</h1>
<p>
January 7th, 2008 -
<a href="http://sachachua.com/blog/p/4659"><a href="http://sachachua.com/blog/p/4659">http://sachachua.com/blog/p/4659</a></a>
</p>

<p>
For January 2008, my assignment is to write a chapter on taking notes
 with Emacs. Here are the blog posts that I plan to write, each around
 1000-2000 words long. This should give me plenty of material to edit,
 if I don't go mad first. ;)
</p>

<pre class="example">
- [ ] Keeping Notes in Emacs
      Structured vs Unstructured (outline, free-form)
      Flat vs Hyperlinked
      Private vs Public
      File structure (one file, daily, snippets)
- [ ] Outline Notes with Org, Blorg
- [ ] Daily Notes with Planner
- [ ] Hyperlinked Notes and Muse
- [ ] Publishing Muse
- [ ] Publishing Planner, RSS
- [ ] Remember: quick note entry
- [ ] Snippets with Howm
- [ ] Blogging from Emacs - WordPress, LJ, Blogger,Muse-Blosxom, EmacsAtomAPI
- [ ] Encrypted Notes (full file, segments) - MOSTLY WRITTEN
</pre>

<p>
I find that thinking of a book as a collection of articles works out
 well for me. Starting with a rough outline like this, I'll write
 2000-word articles of the kind that I'd write for Linux Journal or
 LinuxWorld, and then I'd put them into my outline and add transitions.
 After I write all the pieces, then I can write the introduction and
 the wrap-up sections.
</p>

<p>
Slowly getting the hang of this writing thing&#x2026; =)
</p>

<p>
On Technorati: <a href="http://www.technorati.com/tag/emacs">emacs</a>,
<a href="http://www.technorati.com/tag/writing">writing</a>,
<a href="http://www.technorati.com/tag/wickedcoolemacs">wickedcoolemacs</a>
</p>

<p>
Random Emacs symbol: message-narrow-to-headers-or-head &#x2013; Function:
Narrow the buffer to the head of the message.
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
